src/cf/Reports/БольшойФайл1.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Report>
		<Properties>
			<Name>БольшойФайл1</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТабДок</Name>
					<Type>
						<v8:Type>mxl:SpreadsheetDocument</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Год</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

src/cf/AccumulationRegisters/ОтходыПолученные.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>ОтходыПолученные</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>СпособПолучения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыПолученияОтходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦельПередачи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЦелиПередачиОтходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрагентПередачи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорПередачи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Отход</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторОтходов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДействияСОтходом</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДействияСОтходами</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/cf/Reports/БольшойФайл1/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаСервере
Процедура СформироватьТаблицуНаСервере(ТабличныйДокумент)
	ТаблицаЗначений = Новый ТаблицаЗначений();
	ТаблицаЗначений.Колонки.Добавить("Отход");
	ТаблицаЗначений.Колонки.Добавить("Месяц");
	ТаблицаЗначений.Колонки.Добавить("Контрагент");
	ТаблицаЗначений.Колонки.Добавить("Количество");
	
	ТаблицаЗначенийОтходов = Новый ТаблицаЗначений;
	ТаблицаЗначенийОтходов.Колонки.Добавить("Наменование");
	ТаблицаЗначенийОтходов.Колонки.Добавить("Код"); 
	
	ТаблицаЗначенийСуммаОтходовПоМесяцам = Новый ТаблицаЗначений;
	ТаблицаЗначенийСуммаОтходовПоМесяцам.Колонки.Добавить("Январь");
	ТаблицаЗначенийСуммаОтходовПоМесяцам.Колонки.Добавить("Февраль");
	ТаблицаЗначенийСуммаОтходовПоМесяцам.Колонки.Добавить("Март");
	ТаблицаЗначенийСуммаОтходовПоМесяцам.Колонки.Добавить("Апрель");
	ТаблицаЗначенийСуммаОтходовПоМесяцам.Колонки.Добавить("Май");
	ТаблицаЗначенийСуммаОтходовПоМесяцам.Колонки.Добавить("Июнь");
	ТаблицаЗначенийСуммаОтходовПоМесяцам.Колонки.Добавить("Июль");
	ТаблицаЗначенийСуммаОтходовПоМесяцам.Колонки.Добавить("Август");
	ТаблицаЗначенийСуммаОтходовПоМесяцам.Колонки.Добавить("Сентябрь");
	ТаблицаЗначенийСуммаОтходовПоМесяцам.Колонки.Добавить("Октябрь");
	ТаблицаЗначенийСуммаОтходовПоМесяцам.Колонки.Добавить("Ноябрь");
	ТаблицаЗначенийСуммаОтходовПоМесяцам.Колонки.Добавить("Декабрь");
	ТаблицаЗначенийСуммаОтходовПоМесяцам.Колонки.Добавить("Контрагент");
	
	//ТабДок = Отчет.ТабДок;
	
	Макет = Отчеты.РЭ_БольшойФайл.ПолучитьМакет("Макет");
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РЭ_ОтходыКонтрагентовОбороты.Контрагент КАК Контрагент,
		|	РЭ_ОтходыКонтрагентовОбороты.Организация КАК Организация,
		|	РЭ_ОтходыКонтрагентовОбороты.КоличествоОборот КАК ГодовойОборот
		|ПОМЕСТИТЬ ВТ_КонтрагентыОтобраные
		|ИЗ
		|	РегистрНакопления.РЭ_ОтходыКонтрагентов.Обороты(&Начало, &Конец, Год, Организация = &Организация) КАК РЭ_ОтходыКонтрагентовОбороты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РЭ_ОтходыКонтрагентовОбороты.КоличествоОборот КАК ОборотПервыйКвартал,
		|	ВТ_КонтрагентыОтобраные.Контрагент КАК Контрагент,
		|	ВТ_КонтрагентыОтобраные.Организация КАК Организация
		|ПОМЕСТИТЬ ВТ_ПервыйКвартал
		|ИЗ
		|	ВТ_КонтрагентыОтобраные КАК ВТ_КонтрагентыОтобраные
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РЭ_ОтходыКонтрагентов.Обороты(&Начало, ДОБАВИТЬКДАТЕ(&Конец, КВАРТАЛ, -3), Квартал, Организация = &Организация) КАК РЭ_ОтходыКонтрагентовОбороты
		|		ПО ВТ_КонтрагентыОтобраные.Организация = РЭ_ОтходыКонтрагентовОбороты.Организация
		|			И ВТ_КонтрагентыОтобраные.Контрагент = РЭ_ОтходыКонтрагентовОбороты.Контрагент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РЭ_ОтходыКонтрагентовОбороты.КоличествоОборот КАК ОборотВторойКвартал,
		|	ВТ_КонтрагентыОтобраные.Контрагент КАК Контрагент,
		|	ВТ_КонтрагентыОтобраные.Организация КАК Организация
		|ПОМЕСТИТЬ ВТ_ВторойКвартал
		|ИЗ
		|	ВТ_КонтрагентыОтобраные КАК ВТ_КонтрагентыОтобраные
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РЭ_ОтходыКонтрагентов.Обороты(ДОБАВИТЬКДАТЕ(&Начало, КВАРТАЛ, 1), ДОБАВИТЬКДАТЕ(&Конец, КВАРТАЛ, -2), Квартал, Организация = &Организация) КАК РЭ_ОтходыКонтрагентовОбороты
		|		ПО ВТ_КонтрагентыОтобраные.Организация = РЭ_ОтходыКонтрагентовОбороты.Организация
		|			И ВТ_КонтрагентыОтобраные.Контрагент = РЭ_ОтходыКонтрагентовОбороты.Контрагент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РЭ_ОтходыКонтрагентовОбороты.КоличествоОборот КАК ОборотТретийКвартал,
		|	ВТ_КонтрагентыОтобраные.Контрагент КАК Контрагент,
		|	ВТ_КонтрагентыОтобраные.Организация КАК Организация
		|ПОМЕСТИТЬ ВТ_ТретийКвартал
		|ИЗ
		|	ВТ_КонтрагентыОтобраные КАК ВТ_КонтрагентыОтобраные
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РЭ_ОтходыКонтрагентов.Обороты(ДОБАВИТЬКДАТЕ(&Начало, КВАРТАЛ, 2), ДОБАВИТЬКДАТЕ(&Конец, КВАРТАЛ, -1), Квартал, Организация = &Организация) КАК РЭ_ОтходыКонтрагентовОбороты
		|		ПО ВТ_КонтрагентыОтобраные.Организация = РЭ_ОтходыКонтрагентовОбороты.Организация
		|			И ВТ_КонтрагентыОтобраные.Контрагент = РЭ_ОтходыКонтрагентовОбороты.Контрагент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РЭ_ОтходыКонтрагентовОбороты.КоличествоОборот КАК ОборотЧетвертыйКвартал,
		|	ВТ_КонтрагентыОтобраные.Контрагент КАК Контрагент,
		|	ВТ_КонтрагентыОтобраные.Организация КАК Организация
		|ПОМЕСТИТЬ ВТ_ЧетвертыйКвартал
		|ИЗ
		|	ВТ_КонтрагентыОтобраные КАК ВТ_КонтрагентыОтобраные
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РЭ_ОтходыКонтрагентов.Обороты(ДОБАВИТЬКДАТЕ(&Начало, КВАРТАЛ, 3), &Конец, Квартал, Организация = &Организация) КАК РЭ_ОтходыКонтрагентовОбороты
		|		ПО ВТ_КонтрагентыОтобраные.Организация = РЭ_ОтходыКонтрагентовОбороты.Организация
		|			И ВТ_КонтрагентыОтобраные.Контрагент = РЭ_ОтходыКонтрагентовОбороты.Контрагент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_КонтрагентыОтобраные.Контрагент КАК Контрагент,
		|	ВТ_КонтрагентыОтобраные.Организация КАК Организация,
		|	ВТ_КонтрагентыОтобраные.ГодовойОборот КАК ГодовойОборот,
		|	ВТ_ВторойКвартал.ОборотВторойКвартал КАК ОборотВторойКвартал,
		|	ВТ_ПервыйКвартал.ОборотПервыйКвартал КАК ОборотПервыйКвартал,
		|	ВТ_ТретийКвартал.ОборотТретийКвартал КАК ОборотТретийКвартал,
		|	ВТ_ЧетвертыйКвартал.ОборотЧетвертыйКвартал КАК ОборотЧетвертыйКвартал
		|ПОМЕСТИТЬ ВТ_Шапка
		|ИЗ
		|	ВТ_КонтрагентыОтобраные КАК ВТ_КонтрагентыОтобраные
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПервыйКвартал КАК ВТ_ПервыйКвартал
		|		ПО ВТ_КонтрагентыОтобраные.Организация = ВТ_ПервыйКвартал.Организация
		|			И ВТ_КонтрагентыОтобраные.Контрагент = ВТ_ПервыйКвартал.Контрагент
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВторойКвартал КАК ВТ_ВторойКвартал
		|		ПО ВТ_КонтрагентыОтобраные.Организация = ВТ_ВторойКвартал.Организация
		|			И ВТ_КонтрагентыОтобраные.Контрагент = ВТ_ВторойКвартал.Контрагент
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТретийКвартал КАК ВТ_ТретийКвартал
		|		ПО ВТ_КонтрагентыОтобраные.Организация = ВТ_ТретийКвартал.Организация
		|			И ВТ_КонтрагентыОтобраные.Контрагент = ВТ_ТретийКвартал.Контрагент
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЧетвертыйКвартал КАК ВТ_ЧетвертыйКвартал
		|		ПО ВТ_КонтрагентыОтобраные.Организация = ВТ_ЧетвертыйКвартал.Организация
		|			И ВТ_КонтрагентыОтобраные.Контрагент = ВТ_ЧетвертыйКвартал.Контрагент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РЭ_ОтходыКонтрагентовОбороты.Контрагент КАК Контрагент,
		|	РЭ_ОтходыКонтрагентовОбороты.Отход КАК Отход,
		|	РЭ_ОтходыКонтрагентовОбороты.КоличествоОборот КАК КоличествоОборот,
		|	РЭ_ОтходыКонтрагентовОбороты.Период КАК Период,
		|	ВТ_Шапка.ГодовойОборот КАК ГодовойОборот,
		|	ВТ_Шапка.ОборотВторойКвартал КАК ОборотВторойКвартал,
		|	ВТ_Шапка.ОборотПервыйКвартал КАК ОборотПервыйКвартал,
		|	ВТ_Шапка.ОборотТретийКвартал КАК ОборотТретийКвартал,
		|	ВТ_Шапка.ОборотЧетвертыйКвартал КАК ОборотЧетвертыйКвартал
		|ИЗ
		|	РегистрНакопления.РЭ_ОтходыКонтрагентов.Обороты(&Начало, &Конец, Месяц, Организация = &Организация) КАК РЭ_ОтходыКонтрагентовОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Шапка КАК ВТ_Шапка
		|		ПО (ВТ_Шапка.Организация = РЭ_ОтходыКонтрагентовОбороты.Организация)
		|			И (ВТ_Шапка.Контрагент = РЭ_ОтходыКонтрагентовОбороты.Контрагент)
		|ИТОГИ
		|	СУММА(КоличествоОборот),
		|	СРЕДНЕЕ(ГодовойОборот),
		|	СРЕДНЕЕ(ОборотВторойКвартал),
		|	СРЕДНЕЕ(ОборотПервыйКвартал),
		|	СРЕДНЕЕ(ОборотТретийКвартал),
		|	СРЕДНЕЕ(ОборотЧетвертыйКвартал)
		|ПО
		|	Контрагент,
		|	Период";    
	
	Запрос.УстановитьПараметр("Начало", НачалоГода(Отчет.Год));
	Запрос.УстановитьПараметр("Конец", КонецГода(Отчет.Год));
	Запрос.УстановитьПараметр("Организация", РеквизитОрганизация);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ОбластьКонтрагенты 			= Макет.ПолучитьОбласть("ШапкаКонтрагентов");
	ОбластьСтолбецКонтрагенты 	= Макет.ПолучитьОбласть("ОбластьКонтрагент");
	ОбластьЗаголовок 			= Макет.ПолучитьОбласть("Заголовок");  
	
	ОбластьСтрокаИтогиМесяца 	= Макет.ПолучитьОбласть("СуммаПоМесяцамОбласть");
	ОбластьИтогиМесяцаШапка 	= Макет.ПолучитьОбласть("R12C2:R12C3");
	ОбластьОтходНаименование 	= Макет.ПолучитьОбласть("ОтходОбласть");
	ОбластьОтходСтолбец 		= Макет.ПолучитьОбласть("ОтходСтрокаСтолбец");
	
	//ТабДок.Очистить();                  
	//ТабДок.Вывести(ОбластьЗаголовок);

	ТабличныйДокумент.Вывести(ОбластьКонтрагенты);
	//ТабДок.Вывести(ОбластьШапкаТаблицы);
	
	ВыборкаКонтрагенты = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаКонтрагенты.Следующий() Цикл
		
		ОбластьСтолбецКонтрагенты.Параметры.Контрагент = ВыборкаКонтрагенты.Контрагент;
		ОбластьСтолбецКонтрагенты.Параметры.СуммаГод 			= ВыборкаКонтрагенты.ГодовойОборот;
		ОбластьСтолбецКонтрагенты.Параметры.ПервыйКвартал 		= ВыборкаКонтрагенты.ОборотПервыйКвартал;
		ОбластьСтолбецКонтрагенты.Параметры.ВторойКвартал 		= ВыборкаКонтрагенты.ОборотВторойКвартал;
		ОбластьСтолбецКонтрагенты.Параметры.ТретиКвартал 		= ВыборкаКонтрагенты.ОборотТретийКвартал;
		ОбластьСтолбецКонтрагенты.Параметры.ЧетвертыйКвартал 	= ВыборкаКонтрагенты.ОборотЧетвертыйКвартал;
		
		ТабличныйДокумент.Присоединить(ОбластьСтолбецКонтрагенты);
		
		НоваяСтрока = ТаблицаЗначенийСуммаОтходовПоМесяцам.Добавить();
		НоваяСтрока.Январь		= "";
		НоваяСтрока.Февраль		= "";
		НоваяСтрока.Март		= "";
		НоваяСтрока.Апрель		= "";
		НоваяСтрока.Май			= "";
		НоваяСтрока.Июнь		= "";
		НоваяСтрока.Июль		= "";
		НоваяСтрока.Август		= "";
		НоваяСтрока.Сентябрь	= "";
		НоваяСтрока.Октябрь		= "";
		НоваяСтрока.Ноябрь		= "";
		НоваяСтрока.Декабрь		= ""; 
		НоваяСтрока.Контрагент	= ВыборкаКонтрагенты.Контрагент;
		
		ВыборкаДетальныеЗаписиПоМесяцам = ВыборкаКонтрагенты.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
		Пока ВыборкаДетальныеЗаписиПоМесяцам.Следующий() Цикл   
			
			Если Месяц(ВыборкаДетальныеЗаписиПоМесяцам.Период) = 1 Тогда
				//НайденнаяСтрока = ТаблицаЗначенийСуммаОтходовПоМесяцам.Найти("Январь");
				НоваяСтрока.Январь 		= ВыборкаДетальныеЗаписиПоМесяцам.КоличествоОборот;
			ИначеЕсли Месяц(ВыборкаДетальныеЗаписиПоМесяцам.Период) = 2 Тогда
				НоваяСтрока.Февраль		= ВыборкаДетальныеЗаписиПоМесяцам.КоличествоОборот;
			ИначеЕсли Месяц(ВыборкаДетальныеЗаписиПоМесяцам.Период) = 3 Тогда
				НоваяСтрока.Март		= ВыборкаДетальныеЗаписиПоМесяцам.КоличествоОборот;
			ИначеЕсли Месяц(ВыборкаДетальныеЗаписиПоМесяцам.Период) = 4 Тогда
				НоваяСтрока.Апрель		= ВыборкаДетальныеЗаписиПоМесяцам.КоличествоОборот;
			ИначеЕсли Месяц(ВыборкаДетальныеЗаписиПоМесяцам.Период) = 5 Тогда
				НоваяСтрока.Май			= ВыборкаДетальныеЗаписиПоМесяцам.КоличествоОборот;
			ИначеЕсли Месяц(ВыборкаДетальныеЗаписиПоМесяцам.Период) = 6 Тогда
				НоваяСтрока.Июнь		= ВыборкаДетальныеЗаписиПоМесяцам.КоличествоОборот;
			ИначеЕсли Месяц(ВыборкаДетальныеЗаписиПоМесяцам.Период) = 7 Тогда
				НоваяСтрока.Июль		= ВыборкаДетальныеЗаписиПоМесяцам.КоличествоОборот;
			ИначеЕсли Месяц(ВыборкаДетальныеЗаписиПоМесяцам.Период) = 8 Тогда
				НоваяСтрока.Август		= ВыборкаДетальныеЗаписиПоМесяцам.КоличествоОборот;
			ИначеЕсли Месяц(ВыборкаДетальныеЗаписиПоМесяцам.Период) = 9 Тогда
				НоваяСтрока.Сентябрь	= ВыборкаДетальныеЗаписиПоМесяцам.КоличествоОборот;
			ИначеЕсли Месяц(ВыборкаДетальныеЗаписиПоМесяцам.Период) = 10 Тогда
				НоваяСтрока.Октябрь		= ВыборкаДетальныеЗаписиПоМесяцам.КоличествоОборот;
			ИначеЕсли Месяц(ВыборкаДетальныеЗаписиПоМесяцам.Период) = 11 Тогда
				НоваяСтрока.Ноябрь		= ВыборкаДетальныеЗаписиПоМесяцам.КоличествоОборот;
			ИначеЕсли Месяц(ВыборкаДетальныеЗаписиПоМесяцам.Период) = 12 Тогда
				НоваяСтрока.Декабрь		= ВыборкаДетальныеЗаписиПоМесяцам.КоличествоОборот;
			КонецЕсли;
			
			ВыборкаДетальныеЗаписиПоОтходам = ВыборкаДетальныеЗаписиПоМесяцам.Выбрать(); 
			
			Пока ВыборкаДетальныеЗаписиПоОтходам.Следующий() Цикл
				
				НоваяСтрокаТЗ = ТаблицаЗначений.Добавить();
				НоваяСтрокаТЗ.Отход 		= ВыборкаДетальныеЗаписиПоОтходам.Отход; 
				НоваяСтрокаТЗ.Месяц 		= ВыборкаДетальныеЗаписиПоОтходам.Период;
				НоваяСтрокаТЗ.Контрагент 	= ВыборкаДетальныеЗаписиПоОтходам.Контрагент;
				НоваяСтрокаТЗ.Количество 	= ВыборкаДетальныеЗаписиПоОтходам.КоличествоОборот;

				
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;  
	
	МассивОтходов = Новый Массив;
	ПереработатьТаблицу(ТаблицаЗначений, ТаблицаЗначенийСуммаОтходовПоМесяцам, МассивОтходов);
	
	//Это вывод сумм по месяцам 
	
	ТабличныйДокумент.Вывести(ОбластьИтогиМесяцаШапка);
	Для Каждого СтрокаТЗИтогиМесяца Из ТаблицаЗначенийСуммаОтходовПоМесяцам Цикл 
		
		ОбластьСтрокаИтогиМесяца.Параметры.Итоги1 = СтрокаТЗИтогиМесяца.Январь;
		ОбластьСтрокаИтогиМесяца.Параметры.Итоги2 = СтрокаТЗИтогиМесяца.Февраль;
		ОбластьСтрокаИтогиМесяца.Параметры.Итоги3 = СтрокаТЗИтогиМесяца.Март;
		ОбластьСтрокаИтогиМесяца.Параметры.Итоги4 = СтрокаТЗИтогиМесяца.Апрель;
		ОбластьСтрокаИтогиМесяца.Параметры.Итоги5 = СтрокаТЗИтогиМесяца.Май;
		ОбластьСтрокаИтогиМесяца.Параметры.Итоги6 = СтрокаТЗИтогиМесяца.Июнь;
		ОбластьСтрокаИтогиМесяца.Параметры.Итоги7 = СтрокаТЗИтогиМесяца.Июль;
		ОбластьСтрокаИтогиМесяца.Параметры.Итоги8 = СтрокаТЗИтогиМесяца.Август;
		ОбластьСтрокаИтогиМесяца.Параметры.Итоги9 = СтрокаТЗИтогиМесяца.Сентябрь;
		ОбластьСтрокаИтогиМесяца.Параметры.Итоги10 = СтрокаТЗИтогиМесяца.Октябрь;
		ОбластьСтрокаИтогиМесяца.Параметры.Итоги11 = СтрокаТЗИтогиМесяца.Ноябрь;
		ОбластьСтрокаИтогиМесяца.Параметры.Итоги12 = СтрокаТЗИтогиМесяца.Декабрь;
		
		ТабличныйДокумент.Присоединить(ОбластьСтрокаИтогиМесяца);
	КонецЦикла;

    //Теперь надо вывести месяца по отходам      
	Для Каждого Отхода Из МассивОтходов Цикл 
		
		ОбластьОтходНаименование.Параметры.ОтходНаименование	=	Отхода.НаименованиеПолное;
		ОбластьОтходНаименование.Параметры.ОтходКод				=	Отхода;
		ТабличныйДокумент.Вывести(ОбластьОтходНаименование);
		
		Для Каждого СтрокаТЗИтогиМесяца Из ТаблицаЗначенийСуммаОтходовПоМесяцам Цикл//Это контрогент  
			
			Отбор = Новый Структура("Отход, Контрагент", Отхода, СтрокаТЗИтогиМесяца.Контрагент);
			НайденнаяСтрока = ТаблицаЗначений.НайтиСтроки(Отбор);
			
			Для Каждого Месяц Из НайденнаяСтрока Цикл
				ОбластьОтходСтолбец.Параметры.Месяц1	=	Месяц.Количество;   
				ТабличныйДокумент.Присоединить(ОбластьОтходСтолбец);
			КонецЦикла;

		КонецЦикла;
		
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура СформироватьТаблицу(Команда)
	ТабличныйДокумент = Новый ТабличныйДокумент;
	СформироватьТаблицуНаСервере(ТабличныйДокумент);
	ТабличныйДокумент.Показать();
КонецПроцедуры         

&НаСервере
Процедура ПереработатьТаблицу(ТаблицаЗначенийИсходная, ТаблицаЗначенийСуммаОтходовПоМесяцам, МассивОтходов)  
	
	ТаблицаЗначенийНовая = Новый ТаблицаЗначений();
	ТаблицаЗначенийНовая.Колонки.Добавить("Отход");
	ТаблицаЗначенийНовая.Колонки.Добавить("Месяц");
	ТаблицаЗначенийНовая.Колонки.Добавить("Контрагент");
	ТаблицаЗначенийНовая.Колонки.Добавить("Количество");
	
	Для Каждого СтрокаТЗ Из ТаблицаЗначенийИсходная Цикл
		
		//Проверяем обрабаывали мы такой отход или нет
		Если ЗначениеЗаполнено(ТаблицаЗначенийНовая.Найти(СтрокаТЗ.Отход, "Отход")) Тогда
			Продолжить;
		Иначе
			МассивОтходов.Добавить(СтрокаТЗ.Отход);
		КонецЕсли;   
		
		//По каждому контрагенту создаем строки
		Для Каждого Контрагент Из ТаблицаЗначенийСуммаОтходовПоМесяцам Цикл
			//Пробегаем все месяца
			Для Месяц = 1 По 12 Цикл 
				
				НоваяСтрока = ТаблицаЗначенийНовая.Добавить();
				
				ДатаДляВставки = ДобавитьМесяц(НачалоГода(Отчет.Год), Месяц-1);
				Отбор = Новый Структура("Отход, Контрагент, Месяц", СтрокаТЗ.Отход, Контрагент.Контрагент, ДатаДляВставки);
				НайденнаяСтрока = ТаблицаЗначенийИсходная.НайтиСтроки(Отбор);
				Если ЗначениеЗаполнено(НайденнаяСтрока) Тогда
					НоваяСтрока.Отход			=	НайденнаяСтрока[0].Отход;
					НоваяСтрока.Месяц			=	НайденнаяСтрока[0].Месяц;
					НоваяСтрока.Контрагент		=	НайденнаяСтрока[0].Контрагент;
					НоваяСтрока.Количество		=	НайденнаяСтрока[0].Количество;
				Иначе
					НоваяСтрока.Отход			=	СтрокаТЗ.Отход;
					НоваяСтрока.Месяц			=	ДатаДляВставки;
					НоваяСтрока.Контрагент		=	Контрагент.Контрагент;
					НоваяСтрока.Количество		=	0;								
				КонецЕсли;
				
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	ТаблицаЗначенийИсходная = ТаблицаЗначенийНовая;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьОтчетНаСервере()
	
	ТаблицаЗначений = Новый ТаблицаЗначений();
	ТаблицаЗначений.Колонки.Добавить("Отход");
	ТаблицаЗначений.Колонки.Добавить("Месяц");
	ТаблицаЗначений.Колонки.Добавить("Контрагент");
	ТаблицаЗначений.Колонки.Добавить("Количество");
	
	ТаблицаЗначенийОтходов = Новый ТаблицаЗначений;
	ТаблицаЗначенийОтходов.Колонки.Добавить("Наменование");
	ТаблицаЗначенийОтходов.Колонки.Добавить("Код"); 
	
	ТаблицаЗначенийСуммаОтходовПоМесяцам = Новый ТаблицаЗначений;
	ТаблицаЗначенийСуммаОтходовПоМесяцам.Колонки.Добавить("Январь");
	ТаблицаЗначенийСуммаОтходовПоМесяцам.Колонки.Добавить("Февраль");
	ТаблицаЗначенийСуммаОтходовПоМесяцам.Колонки.Добавить("Март");
	ТаблицаЗначенийСуммаОтходовПоМесяцам.Колонки.Добавить("Апрель");
	ТаблицаЗначенийСуммаОтходовПоМесяцам.Колонки.Добавить("Май");
	ТаблицаЗначенийСуммаОтходовПоМесяцам.Колонки.Добавить("Июнь");
	ТаблицаЗначенийСуммаОтходовПоМесяцам.Колонки.Добавить("Июль");
	ТаблицаЗначенийСуммаОтходовПоМесяцам.Колонки.Добавить("Август");
	ТаблицаЗначенийСуммаОтходовПоМесяцам.Колонки.Добавить("Сентябрь");
	ТаблицаЗначенийСуммаОтходовПоМесяцам.Колонки.Добавить("Октябрь");
	ТаблицаЗначенийСуммаОтходовПоМесяцам.Колонки.Добавить("Ноябрь");
	ТаблицаЗначенийСуммаОтходовПоМесяцам.Колонки.Добавить("Декабрь");
	ТаблицаЗначенийСуммаОтходовПоМесяцам.Колонки.Добавить("Контрагент");
	
	ТабДок = Отчет.ТабДок;
	
	Макет = Отчеты.РЭ_БольшойФайл.ПолучитьМакет("Макет");
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РЭ_ОтходыКонтрагентовОбороты.Контрагент КАК Контрагент,
		|	РЭ_ОтходыКонтрагентовОбороты.Организация КАК Организация,
		|	РЭ_ОтходыКонтрагентовОбороты.КоличествоОборот КАК ГодовойОборот
		|ПОМЕСТИТЬ ВТ_КонтрагентыОтобраные
		|ИЗ
		|	РегистрНакопления.ОтходыПолученные.Обороты(&Начало, &Конец, Год, Организация = &Организация) КАК РЭ_ОтходыКонтрагентовОбороты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РЭ_ОтходыКонтрагентовОбороты.КоличествоОборот КАК ОборотПервыйКвартал,
		|	ВТ_КонтрагентыОтобраные.Контрагент КАК Контрагент,
		|	ВТ_КонтрагентыОтобраные.Организация КАК Организация
		|ПОМЕСТИТЬ ВТ_ПервыйКвартал
		|ИЗ
		|	ВТ_КонтрагентыОтобраные КАК ВТ_КонтрагентыОтобраные
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОтходыПолученные.Обороты(&Начало, ДОБАВИТЬКДАТЕ(&Конец, КВАРТАЛ, -3), Квартал, Организация = &Организация) КАК РЭ_ОтходыКонтрагентовОбороты
		|		ПО ВТ_КонтрагентыОтобраные.Организация = РЭ_ОтходыКонтрагентовОбороты.Организация
		|			И ВТ_КонтрагентыОтобраные.Контрагент = РЭ_ОтходыКонтрагентовОбороты.Контрагент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РЭ_ОтходыКонтрагентовОбороты.КоличествоОборот КАК ОборотВторойКвартал,
		|	ВТ_КонтрагентыОтобраные.Контрагент КАК Контрагент,
		|	ВТ_КонтрагентыОтобраные.Организация КАК Организация
		|ПОМЕСТИТЬ ВТ_ВторойКвартал
		|ИЗ
		|	ВТ_КонтрагентыОтобраные КАК ВТ_КонтрагентыОтобраные
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОтходыПолученные.Обороты(ДОБАВИТЬКДАТЕ(&Начало, КВАРТАЛ, 1), ДОБАВИТЬКДАТЕ(&Конец, КВАРТАЛ, -2), Квартал, Организация = &Организация) КАК РЭ_ОтходыКонтрагентовОбороты
		|		ПО ВТ_КонтрагентыОтобраные.Организация = РЭ_ОтходыКонтрагентовОбороты.Организация
		|			И ВТ_КонтрагентыОтобраные.Контрагент = РЭ_ОтходыКонтрагентовОбороты.Контрагент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РЭ_ОтходыКонтрагентовОбороты.КоличествоОборот КАК ОборотТретийКвартал,
		|	ВТ_КонтрагентыОтобраные.Контрагент КАК Контрагент,
		|	ВТ_КонтрагентыОтобраные.Организация КАК Организация
		|ПОМЕСТИТЬ ВТ_ТретийКвартал
		|ИЗ
		|	ВТ_КонтрагентыОтобраные КАК ВТ_КонтрагентыОтобраные
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОтходыПолученные.Обороты(ДОБАВИТЬКДАТЕ(&Начало, КВАРТАЛ, 2), ДОБАВИТЬКДАТЕ(&Конец, КВАРТАЛ, -1), Квартал, Организация = &Организация) КАК РЭ_ОтходыКонтрагентовОбороты
		|		ПО ВТ_КонтрагентыОтобраные.Организация = РЭ_ОтходыКонтрагентовОбороты.Организация
		|			И ВТ_КонтрагентыОтобраные.Контрагент = РЭ_ОтходыКонтрагентовОбороты.Контрагент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РЭ_ОтходыКонтрагентовОбороты.КоличествоОборот КАК ОборотЧетвертыйКвартал,
		|	ВТ_КонтрагентыОтобраные.Контрагент КАК Контрагент,
		|	ВТ_КонтрагентыОтобраные.Организация КАК Организация
		|ПОМЕСТИТЬ ВТ_ЧетвертыйКвартал
		|ИЗ
		|	ВТ_КонтрагентыОтобраные КАК ВТ_КонтрагентыОтобраные
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОтходыПолученные.Обороты(ДОБАВИТЬКДАТЕ(&Начало, КВАРТАЛ, 3), &Конец, Квартал, Организация = &Организация) КАК РЭ_ОтходыКонтрагентовОбороты
		|		ПО ВТ_КонтрагентыОтобраные.Организация = РЭ_ОтходыКонтрагентовОбороты.Организация
		|			И ВТ_КонтрагентыОтобраные.Контрагент = РЭ_ОтходыКонтрагентовОбороты.Контрагент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_КонтрагентыОтобраные.Контрагент КАК Контрагент,
		|	ВТ_КонтрагентыОтобраные.Организация КАК Организация,
		|	ВТ_КонтрагентыОтобраные.ГодовойОборот КАК ГодовойОборот,
		|	ВТ_ВторойКвартал.ОборотВторойКвартал КАК ОборотВторойКвартал,
		|	ВТ_ПервыйКвартал.ОборотПервыйКвартал КАК ОборотПервыйКвартал,
		|	ВТ_ТретийКвартал.ОборотТретийКвартал КАК ОборотТретийКвартал,
		|	ВТ_ЧетвертыйКвартал.ОборотЧетвертыйКвартал КАК ОборотЧетвертыйКвартал
		|ПОМЕСТИТЬ ВТ_Шапка
		|ИЗ
		|	ВТ_КонтрагентыОтобраные КАК ВТ_КонтрагентыОтобраные
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПервыйКвартал КАК ВТ_ПервыйКвартал
		|		ПО ВТ_КонтрагентыОтобраные.Организация = ВТ_ПервыйКвартал.Организация
		|			И ВТ_КонтрагентыОтобраные.Контрагент = ВТ_ПервыйКвартал.Контрагент
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВторойКвартал КАК ВТ_ВторойКвартал
		|		ПО ВТ_КонтрагентыОтобраные.Организация = ВТ_ВторойКвартал.Организация
		|			И ВТ_КонтрагентыОтобраные.Контрагент = ВТ_ВторойКвартал.Контрагент
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТретийКвартал КАК ВТ_ТретийКвартал
		|		ПО ВТ_КонтрагентыОтобраные.Организация = ВТ_ТретийКвартал.Организация
		|			И ВТ_КонтрагентыОтобраные.Контрагент = ВТ_ТретийКвартал.Контрагент
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЧетвертыйКвартал КАК ВТ_ЧетвертыйКвартал
		|		ПО ВТ_КонтрагентыОтобраные.Организация = ВТ_ЧетвертыйКвартал.Организация
		|			И ВТ_КонтрагентыОтобраные.Контрагент = ВТ_ЧетвертыйКвартал.Контрагент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РЭ_ОтходыКонтрагентовОбороты.Контрагент КАК Контрагент,
		|	РЭ_ОтходыКонтрагентовОбороты.Отход КАК Отход,
		|	РЭ_ОтходыКонтрагентовОбороты.КоличествоОборот КАК КоличествоОборот,
		|	РЭ_ОтходыКонтрагентовОбороты.Период КАК Период,
		|	ВТ_Шапка.ГодовойОборот КАК ГодовойОборот,
		|	ВТ_Шапка.ОборотВторойКвартал КАК ОборотВторойКвартал,
		|	ВТ_Шапка.ОборотПервыйКвартал КАК ОборотПервыйКвартал,
		|	ВТ_Шапка.ОборотТретийКвартал КАК ОборотТретийКвартал,
		|	ВТ_Шапка.ОборотЧетвертыйКвартал КАК ОборотЧетвертыйКвартал
		|ИЗ
		|	РегистрНакопления.ОтходыПолученные.Обороты(&Начало, &Конец, Месяц, Организация = &Организация) КАК РЭ_ОтходыКонтрагентовОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Шапка КАК ВТ_Шапка
		|		ПО (ВТ_Шапка.Организация = РЭ_ОтходыКонтрагентовОбороты.Организация)
		|			И (ВТ_Шапка.Контрагент = РЭ_ОтходыКонтрагентовОбороты.Контрагент)
		|ИТОГИ
		|	СУММА(КоличествоОборот),
		|	СРЕДНЕЕ(ГодовойОборот),
		|	СРЕДНЕЕ(ОборотВторойКвартал),
		|	СРЕДНЕЕ(ОборотПервыйКвартал),
		|	СРЕДНЕЕ(ОборотТретийКвартал),
		|	СРЕДНЕЕ(ОборотЧетвертыйКвартал)
		|ПО
		|	Контрагент,
		|	Период";    
	
	Запрос.УстановитьПараметр("Начало", НачалоГода(Отчет.Год));
	Запрос.УстановитьПараметр("Конец", КонецГода(Отчет.Год));
	Запрос.УстановитьПараметр("Организация", РеквизитОрганизация);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ОбластьКонтрагенты 			= Макет.ПолучитьОбласть("ШапкаКонтрагентов");
	ОбластьСтолбецКонтрагенты 	= Макет.ПолучитьОбласть("ОбластьКонтрагент");
	ОбластьЗаголовок 			= Макет.ПолучитьОбласть("Заголовок");  
	
	ОбластьСтрокаИтогиМесяца 	= Макет.ПолучитьОбласть("СуммаПоМесяцамОбласть");
	ОбластьИтогиМесяцаШапка 	= Макет.ПолучитьОбласть("R12C2:R12C3");
	ОбластьОтходНаименование 	= Макет.ПолучитьОбласть("ОтходОбласть");
	ОбластьОтходСтолбец 		= Макет.ПолучитьОбласть("ОтходСтрокаСтолбец");
	
	ТабДок.Очистить();                  
	//ТабДок.Вывести(ОбластьЗаголовок);

	ТабДок.Вывести(ОбластьКонтрагенты);
	//ТабДок.Вывести(ОбластьШапкаТаблицы);
	
	ВыборкаКонтрагенты = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаКонтрагенты.Следующий() Цикл
		
		ОбластьСтолбецКонтрагенты.Параметры.Контрагент = ВыборкаКонтрагенты.Контрагент;
		ОбластьСтолбецКонтрагенты.Параметры.СуммаГод 			= ВыборкаКонтрагенты.ГодовойОборот;
		ОбластьСтолбецКонтрагенты.Параметры.ПервыйКвартал 		= ВыборкаКонтрагенты.ОборотПервыйКвартал;
		ОбластьСтолбецКонтрагенты.Параметры.ВторойКвартал 		= ВыборкаКонтрагенты.ОборотВторойКвартал;
		ОбластьСтолбецКонтрагенты.Параметры.ТретиКвартал 		= ВыборкаКонтрагенты.ОборотТретийКвартал;
		ОбластьСтолбецКонтрагенты.Параметры.ЧетвертыйКвартал 	= ВыборкаКонтрагенты.ОборотЧетвертыйКвартал;
		
		ТабДок.Присоединить(ОбластьСтолбецКонтрагенты);
		
		НоваяСтрока = ТаблицаЗначенийСуммаОтходовПоМесяцам.Добавить();
		НоваяСтрока.Январь		= "";
		НоваяСтрока.Февраль		= "";
		НоваяСтрока.Март		= "";
		НоваяСтрока.Апрель		= "";
		НоваяСтрока.Май			= "";
		НоваяСтрока.Июнь		= "";
		НоваяСтрока.Июль		= "";
		НоваяСтрока.Август		= "";
		НоваяСтрока.Сентябрь	= "";
		НоваяСтрока.Октябрь		= "";
		НоваяСтрока.Ноябрь		= "";
		НоваяСтрока.Декабрь		= ""; 
		НоваяСтрока.Контрагент	= ВыборкаКонтрагенты.Контрагент;
		
		ВыборкаДетальныеЗаписиПоМесяцам = ВыборкаКонтрагенты.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
		Пока ВыборкаДетальныеЗаписиПоМесяцам.Следующий() Цикл   
			
			Если Месяц(ВыборкаДетальныеЗаписиПоМесяцам.Период) = 1 Тогда
				//НайденнаяСтрока = ТаблицаЗначенийСуммаОтходовПоМесяцам.Найти("Январь");
				НоваяСтрока.Январь 		= ВыборкаДетальныеЗаписиПоМесяцам.КоличествоОборот;
			ИначеЕсли Месяц(ВыборкаДетальныеЗаписиПоМесяцам.Период) = 2 Тогда
				НоваяСтрока.Февраль		= ВыборкаДетальныеЗаписиПоМесяцам.КоличествоОборот;
			ИначеЕсли Месяц(ВыборкаДетальныеЗаписиПоМесяцам.Период) = 3 Тогда
				НоваяСтрока.Март		= ВыборкаДетальныеЗаписиПоМесяцам.КоличествоОборот;
			ИначеЕсли Месяц(ВыборкаДетальныеЗаписиПоМесяцам.Период) = 4 Тогда
				НоваяСтрока.Апрель		= ВыборкаДетальныеЗаписиПоМесяцам.КоличествоОборот;
			ИначеЕсли Месяц(ВыборкаДетальныеЗаписиПоМесяцам.Период) = 5 Тогда
				НоваяСтрока.Май			= ВыборкаДетальныеЗаписиПоМесяцам.КоличествоОборот;
			ИначеЕсли Месяц(ВыборкаДетальныеЗаписиПоМесяцам.Период) = 6 Тогда
				НоваяСтрока.Июнь		= ВыборкаДетальныеЗаписиПоМесяцам.КоличествоОборот;
			ИначеЕсли Месяц(ВыборкаДетальныеЗаписиПоМесяцам.Период) = 7 Тогда
				НоваяСтрока.Июль		= ВыборкаДетальныеЗаписиПоМесяцам.КоличествоОборот;
			ИначеЕсли Месяц(ВыборкаДетальныеЗаписиПоМесяцам.Период) = 8 Тогда
				НоваяСтрока.Август		= ВыборкаДетальныеЗаписиПоМесяцам.КоличествоОборот;
			ИначеЕсли Месяц(ВыборкаДетальныеЗаписиПоМесяцам.Период) = 9 Тогда
				НоваяСтрока.Сентябрь	= ВыборкаДетальныеЗаписиПоМесяцам.КоличествоОборот;
			ИначеЕсли Месяц(ВыборкаДетальныеЗаписиПоМесяцам.Период) = 10 Тогда
				НоваяСтрока.Октябрь		= ВыборкаДетальныеЗаписиПоМесяцам.КоличествоОборот;
			ИначеЕсли Месяц(ВыборкаДетальныеЗаписиПоМесяцам.Период) = 11 Тогда
				НоваяСтрока.Ноябрь		= ВыборкаДетальныеЗаписиПоМесяцам.КоличествоОборот;
			ИначеЕсли Месяц(ВыборкаДетальныеЗаписиПоМесяцам.Период) = 12 Тогда
				НоваяСтрока.Декабрь		= ВыборкаДетальныеЗаписиПоМесяцам.КоличествоОборот;
			КонецЕсли;
			
			ВыборкаДетальныеЗаписиПоОтходам = ВыборкаДетальныеЗаписиПоМесяцам.Выбрать(); 
			
			Пока ВыборкаДетальныеЗаписиПоОтходам.Следующий() Цикл
				
				НоваяСтрокаТЗ = ТаблицаЗначений.Добавить();
				НоваяСтрокаТЗ.Отход 		= ВыборкаДетальныеЗаписиПоОтходам.Отход; 
				НоваяСтрокаТЗ.Месяц 		= ВыборкаДетальныеЗаписиПоОтходам.Период;
				НоваяСтрокаТЗ.Контрагент 	= ВыборкаДетальныеЗаписиПоОтходам.Контрагент;
				НоваяСтрокаТЗ.Количество 	= ВыборкаДетальныеЗаписиПоОтходам.КоличествоОборот;

				
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;  
	
	МассивОтходов = Новый Массив;
	ПереработатьТаблицу(ТаблицаЗначений, ТаблицаЗначенийСуммаОтходовПоМесяцам, МассивОтходов);
	
	//Это вывод сумм по месяцам 
	
	ТабДок.Вывести(ОбластьИтогиМесяцаШапка);
	Для Каждого СтрокаТЗИтогиМесяца Из ТаблицаЗначенийСуммаОтходовПоМесяцам Цикл 
		
		ОбластьСтрокаИтогиМесяца.Параметры.Итоги1 = СтрокаТЗИтогиМесяца.Январь;
		ОбластьСтрокаИтогиМесяца.Параметры.Итоги2 = СтрокаТЗИтогиМесяца.Февраль;
		ОбластьСтрокаИтогиМесяца.Параметры.Итоги3 = СтрокаТЗИтогиМесяца.Март;
		ОбластьСтрокаИтогиМесяца.Параметры.Итоги4 = СтрокаТЗИтогиМесяца.Апрель;
		ОбластьСтрокаИтогиМесяца.Параметры.Итоги5 = СтрокаТЗИтогиМесяца.Май;
		ОбластьСтрокаИтогиМесяца.Параметры.Итоги6 = СтрокаТЗИтогиМесяца.Июнь;
		ОбластьСтрокаИтогиМесяца.Параметры.Итоги7 = СтрокаТЗИтогиМесяца.Июль;
		ОбластьСтрокаИтогиМесяца.Параметры.Итоги8 = СтрокаТЗИтогиМесяца.Август;
		ОбластьСтрокаИтогиМесяца.Параметры.Итоги9 = СтрокаТЗИтогиМесяца.Сентябрь;
		ОбластьСтрокаИтогиМесяца.Параметры.Итоги10 = СтрокаТЗИтогиМесяца.Октябрь;
		ОбластьСтрокаИтогиМесяца.Параметры.Итоги11 = СтрокаТЗИтогиМесяца.Ноябрь;
		ОбластьСтрокаИтогиМесяца.Параметры.Итоги12 = СтрокаТЗИтогиМесяца.Декабрь;
		
		ТабДок.Присоединить(ОбластьСтрокаИтогиМесяца);
	КонецЦикла;

    //Теперь надо вывести месяца по отходам      
	Для Каждого Отхода Из МассивОтходов Цикл 
		
		ОбластьОтходНаименование.Параметры.ОтходНаименование	=	Отхода.НаименованиеПолное;
		ОбластьОтходНаименование.Параметры.ОтходКод				=	Отхода;
		ТабДок.Вывести(ОбластьОтходНаименование);
		
		Для Каждого СтрокаТЗИтогиМесяца Из ТаблицаЗначенийСуммаОтходовПоМесяцам Цикл//Это контрогент  
			
			Отбор = Новый Структура("Отход, Контрагент", Отхода, СтрокаТЗИтогиМесяца.Контрагент);
			НайденнаяСтрока = ТаблицаЗначений.НайтиСтроки(Отбор);
			
			Для Каждого Месяц Из НайденнаяСтрока Цикл
				ОбластьОтходСтолбец.Параметры.Месяц1	=	Месяц.Количество;   
				ТабДок.Присоединить(ОбластьОтходСтолбец);
			КонецЦикла;

		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьОтчет(Команда)
	СформироватьОтчетНаСервере();
КонецПроцедуры
